---
title: Олимпиадное программирование в PascalABC.NET
keywords: olympiads
last_updated: 08.01.2020
sidebar: mydoc_sidebar
permalink: olymp_geometry.html
toc: false
folder: mydoc
---

<script src="//i.upmath.me/latex.js"></script> 

### Задачи, требующие знаний из геометрии

[**ЗАДАЧА №894**](https://acmp.ru/index.asp?main=task&id_task=894)   
	
**Кольцо** (Время: 1 сек. Память: 16 Мб Сложность: 16%)

Заданы площадь кольца и радиус внешней окружности. Требуется определить радиус внутренней окружности. 

#### Входные данные
Входной файл INPUT.TXT содержит два положительных вещественных числа: S и R<sub>1</sub> – площадь кольца и радиус внешней окружности соответственно. Радиус внешней окружности не превышает 100.

#### Выходные данные
В выходной файл OUTPUT.TXT выведите радиус внутренней окружности R<sub>2</sub> с точностью не худшей, чем 10<sup>-3</sup>.

```pascal
begin
  var (s, r) := ReadReal2;
  Write(Sqrt(r * r - s / Pi):0:3)
end.
```

<p>Формула площади кольца изучается в школьной геометрии.
$$S=\pi\left(R_1^2-R_2^2\right) \quad \to \quad R_2=\sqrt{R_1^2-\frac{S}{\pi}}$$</p>
Для представления данных выбран тип `real`.

[**ЗАДАЧА №688**](https://acmp.ru/index.asp?main=task&id_task=688) 		
	
**Суслик и собака** (Время: 1 сек. Память: 16 Мб Сложность: 19%)

На большом поле находятся суслик и собака. Собака хочет суслика съесть, а суслик хочет оказаться в безопасности, добежав до одной из норок, выкопанных в поле. Ни собака, ни суслик в математике не сильны, но, с другой стороны, они и не беспросветно глупы. Суслик выбирает определенную норку и бежит к ней по прямой с определенной скоростью. Собака, которая очень хорошо понимает язык телодвижений, угадывает, к какой норке бежит суслик, и устремляется к ней со скоростью вдвое большей скорости суслика. Если собака добегает до норки первой (раньше суслика), то она съедает суслика; иначе суслик спасается.

Требуется написать программу, которая поможет суслику выбрать норку, в которой он может спастись, если таковая существует.

#### Входные данные
Во входном файле INPUT.TXT записано в первой строке два числа – координаты суслика. Во второй строке записаны два числа – координаты собаки. В третьей строке записано число n – число норок на поле. В следующих n строках записаны координаты норок. Все координаты являются целыми числами, по модулю не превышающими 10000, и записываются через пробел. Количество норок не превышает 1000.

#### Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести число – номер норки, если у суслика есть возможность в ней спастись. Если у суслика есть возможность спрятаться в нескольких норках, то выведите ту, которая первая шла во входных данных. Если суслик не может спастись, то выведите в выходной файл «NO» (без кавычек).

```pascal
begin
  var xg, yg, xd, yd, n, x, y: integer;
  Read(xg, yg, xd, yd, n);
  for var i := 1 to n do
  begin
    Read(x, y);
    if 4 * (Sqr(x - xg) + Sqr(y - yg)) <= Sqr(x - xd) + Sqr(y - yd) then
      begin
        Print(i);
        exit
      end
  end;
  Print('NO')
end.
```
Выигрышная стратегия для суслика состоит в нахождении норки, расстояние до которой не больше удвоенного расстояния от нее до собаки. Положение суслика, собаки и норок задается координатами на плоскости, поэтому здесь требуется знание формулы длины отрезка, концы которого задаются в координатах.
<p>Длина l<sub>AB</sub> отрезка AB с координатами (X<sub>A</sub>,Y<sub>A</sub>) и (X<sub>B</sub>,Y<sub>B</sub>) находится по формуле $$l_{AB}=\sqrt{\left(X_B-X_A \right)^2+\left(Y_B-Y_A \right)^2}$$</p>
Поскольку важны не длины, а результат их сравнения, можно отказаться от извлечения квадратного корня и сравнивать квадраты длин.

