---
title: Олимпиадное программирование в PascalABC.NET
keywords: olympiads
last_updated: 08.01.2020
sidebar: mydoc_sidebar
permalink: olymp_geometry.html
toc: false
folder: mydoc
---

<script src="//i.upmath.me/latex.js"></script> 

## Задачи, требующие знаний из геометрии

[**ЗАДАЧА №894**](https://acmp.ru/index.asp?main=task&id_task=894)   
	
Кольцо
(Время: 1 сек. Память: 16 Мб Сложность: 16%)
Кольцо

Заданы площадь кольца и радиус внешней окружности. Требуется определить радиус внутренней окружности. 

#### Входные данные
Входной файл INPUT.TXT содержит два положительных вещественных числа: S и R<sub>1</sub> – площадь кольца и радиус внешней окружности соответственно. Радиус внешней окружности не превышает 100.

#### Выходные данные
В выходной файл OUTPUT.TXT выведите радиус внутренней окружности R<sub>2</sub> с точностью не худшей, чем 10<sup>-3</sup>.

```pascal
begin
  var (s, r) := ReadReal2;
  Write(Sqrt(r * r - s / Pi):0:3)
end.
```

<p>Формула площади кольца изучается в школьной геометрии.
$$S=\pi(R_1^2-R_2^2) \quad \to R_2=\frac{\sqrt{R_1^2-S}}{\pi}$$</p>
Для представления данных выбран тип `real`.
