---
title: Олимпиадное программирование в PascalABC.NET
keywords: olympiads
last_updated: 07.01.2020
tags: [getting_started]
sidebar: mydoc_sidebar
permalink: olymp_simple.html
toc: false
folder: mydoc
---

## Разбор простейших олимпиадных задач

{% include links.html %}
В первое время тут будут помещаться задачи, взятые с сайта [acmp.ru](https://acmp.ru) 
Тексты программ записаны в соответствии со сложившимися в мировой практике программирования традициями: содержательными именами, отступами, выявляющими структуру программы и т.п. В связи со своеобразной оценкой программ, принятой на сайте ACMP и привязанной не к эффективности, а к длине программного кода, не следует удивляться невысокому рейтингу, который будет там выставляться приводимым программам. Наша задача - показать, как программировать олимпиадные задачи, а не как их оформлять в соответствии с требованиями того или иного олимпиадного ресурса. Не нужно забывать, что олимпиада - это игра, соревнование, а не образовательное мероприятие и организаторы там устанавливают собственные правила.

### Организация ввода и вывода
Сайт ACMP предлагает читать исходные данные из файла input.txt и помещать результаты в файл output.txt. Но значительно проще вводить данные с клавиатуры и выводить результаты на монитор. Если символьные данные во вводе не присутствуют, можно использовать как Read, так и Readln, в противном случае необходимо осознанное применение Readln. Подробности будут объяснены в конкретных задачах. Если при выводе явно не требуется смена строки, достаточно использовать Write (Print).

### Простые алгоритмы, типичные данные

**ЗАДАЧА №766** 
	
Орешки
(Время: 1 сек. Память: 16 Мб Сложность: 3%)

Белочка собрала в лесу N шишек c орешками. Белочка очень привередливо выбирала шишки, и брала только те, в которых ровно M орешков. Также известно, что для пропитания зимой ей необходимо не менее K орешков. Определите, хватит ли на зиму орешков белочке.

#### Входные данные
Входной файл INPUT.TXT содержит три натуральных числа: N, M и K (N, M ≤ 100, K ≤ 10 000).

#### Выходные данные
В выходной файл OUTPUT.TXT выведите «YES» если белочке хватит орешков и «NO» в противном случае.

```pascal
begin
  var (n, m, k) := ReadInteger3;
  Print(n * m >= k ? 'YES' : 'NO') 
end.
```

Алгоритм здесь примитивный. Белочка отобрала N шишек, в каждой из которых М орешков. Осталось перемножить N и M и сравнить результат с потребностью в шишках K. Произведение не может превышать 100 х 100 = 10 000. Данные типа `integer` позволяют работать с величинами до 2.1 млрд, так что проблем не ожидается.
