---
title: Олимпиадные задачи - простая математика
keywords: olympiads
last_updated: 08.01.2020
sidebar: mydoc_sidebar
permalink: olymp_simple_math.html
toc: false
folder: mydoc
---

<script src="//i.upmath.me/latex.js"></script> 

### Задачи, требующие некоторого знания математики

[**ЗАДАЧА №312**](https://acmp.ru/index.asp?main=task&id_task=312)   
	
**Арифметическая прогрессия** (Время: 1 сек. Память: 16 Мб Сложность: 15%)

Заданы первый и второй элементы арифметической прогрессии. Требуется написать программу, которая вычислит элемент прогрессии по ее номеру.

**Входные данные**

Входной файл INPUT.TXT содержит три целых числа, разделенных пробелами – первый элемент прогрессии A<sub>1</sub> (1 ≤ A<sub>1</sub> ≤ 1000), второй элемент прогрессии A<sub>2</sub> (1 ≤ A<sub>2</sub> ≤ 1000), и номер требуемого элемента N (1 ≤ N ≤ 1000).

**Выходные данные**

Выходной файл OUTPUT.TXT должен содержать одно целое число - N-й элемент арифметической прогрессии.

```pascal
begin
  var (a1, a2, n) := ReadInteger3;
  Print(a1 + (a2 - a1) * (n - 1))
end.
```

<p>Из курса школьной матеметики известна формула
$$a_n=a_1+d(n-1),\ d=a_k-a_{k-1}=a_2-a_1 \to a_n=a_1+(a_2-a_1)(n-1)$$</p>
Для представления данных достаточно стандартного типа `integer`.

[**ЗАДАЧА №411**](https://acmp.ru/index.asp?main=task&id_task=411) 		
	
**Квадратное уравнение** (Время: 1 сек. Память: 16 Мб Сложность: 28%)

Сложно найти человека, который любит решать однообразные задачки по математике. В последнее время школьникам стало легче, ведь с появлением компьютеров почти в каждой квартире стало существенно проще проверять себя. Но программы, в которых решение уравнений является стандартной функцией, установлены не везде. Напишите программу, которая сможет решить уравнение 
ax<sup>2</sup> + bx + c = 0 при заданных коэффициентах a, b и c.

**Входные данные**

Единственная строка входного файла INPUT.TXT содержит три целых числа a, b и c, каждое из которых не превосходит по модулю 30000. Числа разделяются пробелами.

**Выходные данные**

На первой строке выходного файла OUTPUT.TXT выведите число различных действительных корней заданного уравнения. Затем выведите сами корни по одному на строке с ошибкой, не превосходящей 10<sup>-4</sup>. Если для заданных коэффициентов корней бесконечно много, на единственной строке выходного файла выведите -1.

```pascal
begin
  var (a, b, c) := ReadReal3;
  if a = 0 then
    if b = 0 then
      Print(c = 0 ? -1 : 0)
    else
      Write(1, NewLine, -c / b:0:6)
  else
  begin
    var d := b * b - 4 * a * c;
    if d < 0 then
      Print(0)
    else if d = 0 then
      Write(1, NewLine, -b / (2 * a):0:6)
    else
    begin
      d := Sqrt(d);
      Write(2, NewLine, (-b - d) / (2 * a):0:6, NewLine,
          (-b + d) / (2 * a):0:6)
    end
  end
end.
```

Некоторую сложность этой задаче придает разветвленность алгоритма. В самом деле, при а = 0 квадратное уравнение вырождается в уравнение первой степени, а при a = b = 0 возникает вариант с = 0, где при с = 0 получается тождество 0 = 0 и х может быть любым, а при с ≠ 0 решений нет. Первая ветка алгоритма есть: **если (a = 0 и b = 0), то при с = 0 вывести -1, иначе вывести 0**

Уравнение первой степени имеет вид bx+c = 0, откуда х = -с/b. Случай с b = 0 здесь невозможен, он исключен предыдущей веткой и уравнение имеет единственный корень. Можно включать в алгоритм и эту ветку. **если (a = 0 и b ≠ 0), то вывести 1 и в следующей строке хначение -c/b**

Осталось рассмотреть случай a ≠ 0, приводящий к квадратному уравнению. Алгоритм решения квадратного урвнения школьникам известен. Сначала вычисляется дискриминант D = b<sup>2</sup> - 4ac. Далее возможны три случая. При D < 0 действительных корней нет и выводим 0 (вот оно - коварство этого задания - корней нет, значит их ноль). При D = 0 имеются два совпадающих корня ("корни действительные и равные"), но в задаче требуется вывести число различных действительных корней, поэтому тут выводим 1 и значение одного корня, равное -b / 2a. 
<p>Наконец, при D > 0 уравнение имеет два действительных и различных корня. Здесь выводим 2 и значения корней, полученные по формуле $$x_{1,2}=\frac{-b\pm\sqrt{D}}{2a}$$</p>
Исходные данные представляем в стандартном типе `real`

[**ЗАДАЧА №682**](https://acmp.ru/index.asp?main=task&id_task=682)
	
**Сумма n-значных чисел** (Время: 1 сек. Память: 16 Мб Сложность: 30%)

По заданному n найти сумму всех n-значных чисел.

**Входные данные**
В единственной строке входного файла INPUT.TXT записано одно натуральное число n (1 ≤ n ≤ 100).

**Выходные данные**
В единственную строку выходного файла OUTPUT.TXT нужно вывести все цифры суммы всех n-значных чисел.

```pascal
begin
  var n := ReadInteger;
  var k := Biginteger(10) ** (n - 1);
  Print((11 * k - 1) * 9 * k div 2)
end.
```

<p>Задача на нахождение суммы арифметической прогрессии
$$S=frac{a_1+a_n}{2}n$$
Сложность в том, что эта сумма может оказаться очень большой для n-значных чисел. Например, если n=100, то нужно найти значение
$$S=frac{10^{99}+(10^{100}-1}{2}9\cdot10^{99}$$ - это число, запись которого содержит около 200 цифр.</p>
Следовательно, понадобится использовать тип `BigInteger`.
