---
title: Олимпиадное программирование в PascalABC.NET
keywords: olympiads
last_updated: 07.01.2020
tags: [getting_started]
sidebar: mydoc_sidebar
permalink: olymp_simple.html
toc: false
folder: mydoc
---

## Разбор простейших олимпиадных задач

{% include links.html %}
В первое время тут будут помещаться задачи, взятые с сайта [acmp.ru](https://acmp.ru) 
Тексты программ записаны в соответствии со сложившимися в мировой практике программирования традициями: содержательными именами, отступами, выявляющими структуру программы и т.п. В связи со своеобразной оценкой программ, принятой на сайте ACMP и привязанной не к эффективности, а к длине программного кода, не следует удивляться невысокому рейтингу, который будет там выставляться приводимым программам. Наша задача - показать, как программировать олимпиадные задачи, а не как их оформлять в соответствии с требованиями того или иного олимпиадного ресурса. Не нужно забывать, что олимпиада - это игра, соревнование, а не образовательное мероприятие и организаторы там устанавливают собственные правила.

### Организация ввода и вывода
Сайт ACMP предлагает читать исходные данные из файла input.txt и помещать результаты в файл output.txt. Но значительно проще вводить данные с клавиатуры и выводить результаты на монитор. Если символьные данные во вводе не присутствуют, можно использовать как Read, так и Readln, в противном случае необходимо осознанное применение Readln. Подробности будут объяснены в конкретных задачах. Если при выводе явно не требуется смена строки, достаточно использовать Write (Print).

### 1. Простые алгоритмы

[**ЗАДАЧА №766**](https://acmp.ru/index.asp?main=task&id_task=766)   
	
Орешки
(Время: 1 сек. Память: 16 Мб Сложность: 3%)

Белочка собрала в лесу N шишек c орешками. Белочка очень привередливо выбирала шишки, и брала только те, в которых ровно M орешков. Также известно, что для пропитания зимой ей необходимо не менее K орешков. Определите, хватит ли на зиму орешков белочке.

#### Входные данные
Входной файл INPUT.TXT содержит три натуральных числа: N, M и K (N, M ≤ 100, K ≤ 10 000).

#### Выходные данные
В выходной файл OUTPUT.TXT выведите «YES» если белочке хватит орешков и «NO» в противном случае.

```pascal
begin
  var (n, m, k) := ReadInteger3;
  Print(n * m >= k ? 'YES' : 'NO') 
end.
```

Алгоритм здесь примитивный. Белочка отобрала N шишек, в каждой из которых М орешков. Осталось перемножить N и M и сравнить результат с потребностью в шишках K. Произведение не может превышать 100 х 100 = 10 000. Данные типа `integer` позволяют работать с величинами до 2.1 млрд, так что проблем не ожидается.

[**ЗАДАЧА №819**](https://acmp.ru/index.asp?main=task&id_task=819) 		
	
Прямоугольный параллелепипед
(Время: 1 сек. Память: 16 Мб Сложность: 10%)

Прямоугольный параллелепипед - это объемная фигура, у которой шесть граней, и каждая из них является прямоугольником. Моделями прямоугольного параллелепипеда служат классная комната, кирпич, спичечная коробка. Длины трех ребер прямоугольного параллелепипеда, имеющих общий конец, называют его измерениями. На приведенном рисунке измерения представлены ребрами AB, BC и BF с общим концом в точке B, а значения измерений равны их длинам a, b и c соответственно.

По заданным измерениям прямоугольного параллелепипеда Вам необходимо определить площадь его поверхности и объем.
#### Входные данные
Единственная строка входного файла INPUT.TXT содержит разделенные пробелом три натуральных числа A, B и С – измерения параллелепипеда, каждое из измерений не превышает 10<sup>6</sup>.

#### Выходные данные
В выходной файл OUTPUT.TXT выведите через пробел два целых числа: площадь поверхности и объем заданного параллелепипеда.

```pascal
begin
  var a, b, c: int64;
  Read(a, b, c);
  var s := 2 * (a * b + a * c + b * c);
  Print(s, a * b * c)
end.
```

Еще одна задача с примитивным алгоритмом. Требуется знание формул площади поверхности (S) и объема (V)прямоугольного параллелепипеда:
<p>$$S=2(ab+ac+bc), V=abc$$</p>
Небольшой подвох - диапазон представления данных. Куб от десяти в шестой степени - это десять в восемнадцатой, что выходит за диапазон представления данных типа `integer`. Но все же попадает в диапазон для типа `int64`. А Print идеально вписывается в выполнение требования о выводе через пробел.

[**ЗАДАЧА №10**](https://acmp.ru/index.asp?main=task&id_task=10) 		
	
Уравнение
(Время: 1 сек. Память: 16 Мб Сложность: 17%)

Вася в школе изучил квадратные уравнения и понял, как они легко решаются путем вычисления дискриминанта. Но Петя поведал ему о методе решения кубических уравнений вида Ax<sup>3</sup> + Bx<sup>2</sup> + Cx + D = 0. На факультативе по математике Васе задали решить около ста уравнений как раз такого вида. Но, к сожалению, Вася забыл формулы, о которых рассказывал ему Петя. Но Васе было известно, что все корни уравнений – целые числа и находятся на отрезке \[-100, 100]. Поэтому у Васи есть шанс найти их методом перебора, но для этого ему придется затратить уйму времени, т.к. возможно необходимо будет осуществить перебор нескольких тысяч значений. Помогите Васе написать программу, которая поможет ему найти корни кубических уравнений!
#### Входные данные
В единственной строке входного файла INPUT.TXT записаны 4 числа: A, B, C и D – целые коэффициенты кубического уравнения. Каждый коэффициент по модулю меньше 32768, A ≠ 0.

#### Выходные данные
В единственную строку выходного файла OUTPUT.TXT нужно вывести через пробел в порядке возрастания все корни заданного кубического уравнения. Кратные корни следует выводить только один раз.

```pascal
begin
  var a, b, c, d: int64;
  Readln(a, b, c, d);
  for var x := -100 to 100 do
  begin 
    var k := 0;
    if d + x * (c + x * (b + a * x)) = 0 then
    begin
      k += 1;
      Print(x);
      if k = 3 then exit
    end
  end 
end.
```

Не нужно поддаваться лукавой фразе "возможно необходимо будет осуществить перебор нескольких тысяч значений". На интервале от -100 до 100 имеется ровно 201 целое число. Значение выражения Ax<sup>3</sup> по абсолютной величине может достигать 32767х100<sup>3</sup> = 32 767 000 000, что превышает границу 2.1 млрд. для данных типа `integer`. Приходится использовать тип `int64`. Значение левой части уравнения удобно вычислять по известной схеме Горнера для нахождения значений полиномов: D+x(C+x(B+Ax)). Это избавляет от непрятностей с вычислением значений степеней х.
Задача решается путем прямого перебора ("брутфорс" - brute force) всех возможных значений х. Поскольку кубическое уравнение может иметь максимум три действительных корня, при достижении счетчиком найденных корней k значения 3 цикл перебора прерывается. При переборе корней в направлении от -100 к 100 требования выводить корни в порядке возрастания и выводить кратные корни только один раз выполняются автоматически. Использование процедуры Print обеспечивает вывод данных черех пробел.

