---
title: Олимпиадные задачи - простая математика
keywords: olympiads
last_updated: 08.01.2020
sidebar: mydoc_sidebar
permalink: olymp_simple_math.html
toc: false
folder: mydoc
---

<script src="//i.upmath.me/latex.js"></script> 

### Задачи, требующие некоторого знания математики

[**ЗАДАЧА №312**](https://acmp.ru/index.asp?main=task&id_task=312)   
	
**Арифметическая прогрессия** (Время: 1 сек. Память: 16 Мб Сложность: 15%)

Заданы первый и второй элементы арифметической прогрессии. Требуется написать программу, которая вычислит элемент прогрессии по ее номеру.

**Входные данные**

Входной файл INPUT.TXT содержит три целых числа, разделенных пробелами – первый элемент прогрессии A<sub>1</sub> (1 ≤ A<sub>1</sub> ≤ 1000), второй элемент прогрессии A<sub>2</sub> (1 ≤ A<sub>2</sub> ≤ 1000), и номер требуемого элемента N (1 ≤ N ≤ 1000).

**Выходные данные**

Выходной файл OUTPUT.TXT должен содержать одно целое число - N-й элемент арифметической прогрессии.

```pascal
begin
  var (a1, a2, n) := ReadInteger3;
  Print(a1 + (a2 - a1) * (n - 1))
end.
```

<p>Из курса школьной матеметики известна формула
$$a_n=a_1+d(n-1),\ d=a_k-a_{k-1}=a_2-a_1 \to a_n=a_1+(a_2-a_1)(n-1)$$</p>
Для представления данных достаточно стандартного типа `integer`.

[**ЗАДАЧА №411**](https://acmp.ru/index.asp?main=task&id_task=411) 		
	
**Квадратное уравнение** (Время: 1 сек. Память: 16 Мб Сложность: 28%)

Сложно найти человека, который любит решать однообразные задачки по математике. В последнее время школьникам стало легче, ведь с появлением компьютеров почти в каждой квартире стало существенно проще проверять себя. Но программы, в которых решение уравнений является стандартной функцией, установлены не везде. Напишите программу, которая сможет решить уравнение 
ax<sup>2</sup> + bx + c = 0 при заданных коэффициентах a, b и c.

**Входные данные**

Единственная строка входного файла INPUT.TXT содержит три целых числа a, b и c, каждое из которых не превосходит по модулю 30000. Числа разделяются пробелами.

**Выходные данные**

На первой строке выходного файла OUTPUT.TXT выведите число различных действительных корней заданного уравнения. Затем выведите сами корни по одному на строке с ошибкой, не превосходящей 10<sup>-4</sup>. Если для заданных коэффициентов корней бесконечно много, на единственной строке выходного файла выведите -1.

```pascal
begin
  var (a, b, c) := ReadReal3;
  if a = 0 then
    if b = 0 then
      if c = 0 then
        Print(-1)
      else
        Print(0)
    else
      Write(1, NewLine, -c / b:0:6)
  else
  begin
    var d := b * b - 4.0 * a * c;
    if d < 0 then
      Print(0)
    else if d = 0 then
      Write(1, NewLine, -b / (2.0 * a):0:6)
    else
    begin
      d := Sqrt(d);
      Write(2, NewLine, (-b - d) / (2.0 * a):0:6, NewLine,
          (-b + d) / (2.0 * a):0:6)
    end
  end
end.
```

